---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithFold.MiddleBendLength
source: html/be570c26-a4b5-bf76-e6e8-aa5253465b37.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithFold.MiddleBendLength Property

Middle Bend segment length.

## Syntax (C#)
```csharp
public double MiddleBendLength { get; set; }
```